In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
 'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.288338 -0.092278
1    a  two -0.142362  1.460161
2    b  one -0.406816  0.747985
3    b  two -0.749932  1.958803
4    a  one -0.975835  0.255269

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.468845
b   -0.578374
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.632087
      two    -0.142362
b     one    -0.406816
      two    -0.749932
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.632087 -0.142362
b    -0.406816 -0.749932

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.142362
            2006   -0.406816
Ohio        2005   -0.519135
            2006   -0.975835
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.468845  0.541051
b    -0.578374  1.353394

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.632087  0.081496
     two  -0.142362  1.460161
b    one  -0.406816  0.747985
     two  -0.749932  1.958803

In [15]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [17]:
for name, group in df.groupby('key1'):
 print(name)
 print(group)

a
  key1 key2     data1     data2
0    a  one -0.288338 -0.092278
1    a  two -0.142362  1.460161
4    a  one -0.975835  0.255269
b
  key1 key2     data1     data2
2    b  one -0.406816  0.747985
3    b  two -0.749932  1.958803

In [18]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
 print((k1, k2))
 print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.288338 -0.092278
4    a  one -0.975835  0.255269
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.142362  1.460161
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.406816  0.747985
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.749932  1.958803

In [19]:
pieces = dict(list(df.groupby('key1')))

In [20]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.406816  0.747985
3    b  two -0.749932  1.958803

In [21]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [22]:
grouped = df.groupby(df.dtypes, axis=1)

In [23]:
for dtype, group in grouped:
 print(dtype)
 print(group)

float64
      data1     data2
0 -0.288338 -0.092278
1 -0.142362  1.460161
2 -0.406816  0.747985
3 -0.749932  1.958803
4 -0.975835  0.255269
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [24]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.081496
     two   1.460161
b    one   0.747985
     two   1.958803

In [25]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [26]:
s_grouped

In [27]:
s_grouped.mean()

key1  key2
a     one     0.081496
      two     1.460161
b     one     0.747985
      two     1.958803
Name: data2, dtype: float64

In [28]:
people = pd.DataFrame(np.random.randn(5, 5),
 columns=['a', 'b', 'c', 'd', 'e'],
 index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [29]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [30]:
people

               a         b         c         d         e
Joe    -0.182077 -0.544552 -1.560977 -1.194540 -0.339530
Steve  -1.327512  1.082162  0.214584  0.909350  0.915677
Wes    -0.664394       NaN       NaN  0.645117  0.345112
Jim     1.697546  1.786802  0.654136  1.187512 -0.161855
Travis  1.245970 -1.028615  0.628746 -0.191089 -0.916398

In [31]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [32]:
by_column = people.groupby(mapping, axis=1)

In [33]:
by_column.sum()

            blue       red
Joe    -2.755516 -1.066159
Steve   1.123934  0.670328
Wes     0.645117 -0.319282
Jim     1.841648  3.322494
Travis  0.437657 -0.699042

In [34]:
map_series = pd.Series(mapping)

In [35]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [36]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [37]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.851075  1.242250 -0.906841  0.638089 -0.156273
5 -1.327512  1.082162  0.214584  0.909350  0.915677
6  1.245970 -1.028615  0.628746 -0.191089 -0.916398

In [38]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [39]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.664394 -0.544552 -1.560977 -1.194540 -0.339530
  two  1.697546  1.786802  0.654136  1.187512 -0.161855
5 one -1.327512  1.082162  0.214584  0.909350  0.915677
6 two  1.245970 -1.028615  0.628746 -0.191089 -0.916398

In [40]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
  [1, 3, 5, 1, 3]],
 names=['cty', 'tenor'])

In [41]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [42]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.038347 -0.287997 -0.760611 -0.245969 -0.906683
1     -1.121169  0.066923 -0.244245  0.321372  1.115093
2      0.840613  1.097667 -0.233418  1.560186  0.876668
3     -1.032124  0.587179 -0.411190 -1.175934 -0.625155

In [43]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [44]:
df

  key1 key2     data1     data2
0    a  one -0.288338 -0.092278
1    a  two -0.142362  1.460161
2    b  one -0.406816  0.747985
3    b  two -0.749932  1.958803
4    a  one -0.975835  0.255269

In [45]:
grouped = df.groupby('key1')

In [46]:
grouped['data1'].quantile(0.9)

key1
a   -0.171557
b   -0.441127
Name: data1, dtype: float64

In [47]:
def peak_to_peak(arr):
 return arr.max() - arr.min()

In [48]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.833473  1.552439
b     0.343116  1.210818

In [49]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.468845  0.445091 -0.975835 -0.632087 -0.288338 -0.215350
b      2.0 -0.578374  0.242620 -0.749932 -0.664153 -0.578374 -0.492595

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.142362   3.0  0.541051  0.814721 -0.092278  0.081496  0.255269
b    -0.406816   2.0  1.353394  0.856178  0.747985  1.050689  1.353394


           75%       max
key1
a     0.857715  1.460161
b     1.656099  1.958803

In [50]:
s = pd.Series(np.random.randn(6))

In [51]:
s[::2] = np.nan

In [52]:
s

0         NaN
1   -0.380995
2         NaN
3   -0.429310
4         NaN
5    0.628303
dtype: float64

In [53]:
s.fillna(s.mean())

0   -0.060667
1   -0.380995
2   -0.060667
3   -0.429310
4   -0.060667
5    0.628303
dtype: float64

In [54]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
 'Oregon', 'Nevada', 'California', 'Idaho']

In [55]:
group_key = ['East'] * 4 + ['West'] * 4

In [56]:
data = pd.Series(np.random.randn(8), index=states)

In [57]:
data

Ohio          0.151504
New York      0.884902
Vermont      -1.292840
Florida       0.024286
Oregon        2.015998
Nevada        1.242572
California   -0.798704
Idaho         0.930602
dtype: float64

In [58]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [59]:
data

Ohio          0.151504
New York      0.884902
Vermont            NaN
Florida       0.024286
Oregon        2.015998
Nevada             NaN
California   -0.798704
Idaho              NaN
dtype: float64

In [60]:
data.groupby(group_key).mean()

East    0.353564
West    0.608647
dtype: float64

In [61]:
fill_mean = lambda g: g.fillna(g.mean())

In [62]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.151504
New York      0.884902
Vermont       0.353564
Florida       0.024286
Oregon        2.015998
Nevada        0.608647
California   -0.798704
Idaho         0.608647
dtype: float64

In [63]:
fill_values = {'East': 0.5, 'West': -1}

In [64]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [65]:
data.groupby(group_key).apply(fill_func)

Ohio          0.151504
New York      0.884902
Vermont       0.500000
Florida       0.024286
Oregon        2.015998
Nevada       -1.000000
California   -0.798704
Idaho        -1.000000
dtype: float64

In [69]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
 cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [70]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [71]:
def draw(deck, n=5):
  return deck.sample(n)

In [72]:
draw(deck)

KC    10
2S     2
5H     5
3H     3
7S     7
dtype: int64

In [73]:
get_suit = lambda card: card[-1] # last letter is suit

In [74]:
deck.groupby(get_suit).apply(draw, n=2)

C  9C      9
   4C      4
D  4D      4
   10D    10
H  JH     10
   10H    10
S  4S      4
   7S      7
dtype: int64

In [75]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

JC    10
7C     7
7D     7
8D     8
AH     1
3H     3
2S     2
7S     7
dtype: int64

In [76]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
  'b', 'b', 'b', 'b'],
  'data': np.random.randn(8),
  'weights': np.random.rand(8)})

In [77]:
df

  category      data   weights
0        a -0.182560  0.576431
1        a  0.618936  0.035192
2        a  2.900191  0.803390
3        a -0.628585  0.400696
4        b  1.681739  0.158361
5        b -0.911388  0.366780
6        b  1.093257  0.596744
7        b -0.553769  0.939218

In [78]:
grouped = df.groupby('category')

In [79]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [80]:
grouped.apply(get_wavg)

category
a    1.098558
b    0.031211
dtype: float64

In [85]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
 Y = data[yvar]
 X = data[xvars]
 X['intercept'] = 1.
 result = sm.OLS(Y, X).fit()
 return result.params

In [ ]:
tips.pivot_table(index=['day', 'smoker'])

In [ ]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
 columns='smoker')

In [88]:
data

Ohio          0.151504
New York      0.884902
Vermont            NaN
Florida       0.024286
Oregon        2.015998
Nevada             NaN
California   -0.798704
Idaho              NaN
dtype: float64